---
title: AdvancedWood
classe: Autodesk.Revit.DB.Visual.AdvancedWood
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 47
---

# AdvancedWood

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String WoodCurlyDistortionEnable { get; }` | `AdvancedWood.WoodCurlyDistortionEnable` | String |
| `String WoodCurlyDistortionMap { get; }` | `AdvancedWood.WoodCurlyDistortionMap` | String |
| `String WoodCurlyDistortionScale { get; }` | `AdvancedWood.WoodCurlyDistortionScale` | String |
| `String WoodDiffuseLobeWeight { get; }` | `AdvancedWood.WoodDiffuseLobeWeight` | String |
| `String WoodDiffusePerlinEnable { get; }` | `AdvancedWood.WoodDiffusePerlinEnable` | String |
| `String WoodDiffusePerlinProf { get; }` | `AdvancedWood.WoodDiffusePerlinProf` | String |
| `String WoodDiffusePerlinScaleZ { get; }` | `AdvancedWood.WoodDiffusePerlinScaleZ` | String |
| `String WoodEarlyColor { get; }` | `AdvancedWood.WoodEarlyColor` | String |
| `String WoodEarlycolorPerlinEnable { get; }` | `AdvancedWood.WoodEarlycolorPerlinEnable` | String |
| `String WoodEarlycolorPerlinProf { get; }` | `AdvancedWood.WoodEarlycolorPerlinProf` | String |
| `String WoodEarlywoodSharpness { get; }` | `AdvancedWood.WoodEarlywoodSharpness` | String |
| `String WoodFiberCosineEnable { get; }` | `AdvancedWood.WoodFiberCosineEnable` | String |
| `String WoodFiberCosineProf { get; }` | `AdvancedWood.WoodFiberCosineProf` | String |
| `String WoodFiberPerlinEnable { get; }` | `AdvancedWood.WoodFiberPerlinEnable` | String |
| `String WoodFiberPerlinProf { get; }` | `AdvancedWood.WoodFiberPerlinProf` | String |
| `String WoodFiberPerlinScaleZ { get; }` | `AdvancedWood.WoodFiberPerlinScaleZ` | String |
| `String WoodFiberRoughness { get; }` | `AdvancedWood.WoodFiberRoughness` | String |
| `String WoodGrooveRoughness { get; }` | `AdvancedWood.WoodGrooveRoughness` | String |
| `String WoodGrowthPerlinEnable { get; }` | `AdvancedWood.WoodGrowthPerlinEnable` | String |
| `String WoodGrowthPerlinProf { get; }` | `AdvancedWood.WoodGrowthPerlinProf` | String |
| `String WoodLatecolorPerlinEnable { get; }` | `AdvancedWood.WoodLatecolorPerlinEnable` | String |
| `String WoodLatecolorPerlinProf { get; }` | `AdvancedWood.WoodLatecolorPerlinProf` | String |
| `String WoodLateColorPower { get; }` | `AdvancedWood.WoodLateColorPower` | String |
| `String WoodLatewoodBumpDepth { get; }` | `AdvancedWood.WoodLatewoodBumpDepth` | String |
| `String WoodLatewoodRatio { get; }` | `AdvancedWood.WoodLatewoodRatio` | String |
| `String WoodLatewoodSharpness { get; }` | `AdvancedWood.WoodLatewoodSharpness` | String |
| `String WoodManualLateColor { get; }` | `AdvancedWood.WoodManualLateColor` | String |
| `String WoodPoreCellDim { get; }` | `AdvancedWood.WoodPoreCellDim` | String |
| `String WoodPoreColorPower { get; }` | `AdvancedWood.WoodPoreColorPower` | String |
| `String WoodPoreDepth { get; }` | `AdvancedWood.WoodPoreDepth` | String |
| `String WoodPoreRadius { get; }` | `AdvancedWood.WoodPoreRadius` | String |
| `String WoodPoreType { get; }` | `AdvancedWood.WoodPoreType` | String |
| `String WoodRayColorPower { get; }` | `AdvancedWood.WoodRayColorPower` | String |
| `String WoodRayEllipseRadiusX { get; }` | `AdvancedWood.WoodRayEllipseRadiusX` | String |
| `String WoodRayEllipseZ2x { get; }` | `AdvancedWood.WoodRayEllipseZ2x` | String |
| `String WoodRayNumSlices { get; }` | `AdvancedWood.WoodRayNumSlices` | String |
| `String WoodRaySegLengthZ { get; }` | `AdvancedWood.WoodRaySegLengthZ` | String |
| `String WoodRingThickness { get; }` | `AdvancedWood.WoodRingThickness` | String |
| `String WoodSecondaryColorPower { get; }` | `AdvancedWood.WoodSecondaryColorPower` | String |
| `String WoodSecondaryPerlinEnable { get; }` | `AdvancedWood.WoodSecondaryPerlinEnable` | String |
| `String WoodSecondaryPerlinProf { get; }` | `AdvancedWood.WoodSecondaryPerlinProf` | String |
| `String WoodSecondaryPerlinScaleZ { get; }` | `AdvancedWood.WoodSecondaryPerlinScaleZ` | String |
| `String WoodUseGrooveRoughness { get; }` | `AdvancedWood.WoodUseGrooveRoughness` | String |
| `String WoodUseLatewoodBump { get; }` | `AdvancedWood.WoodUseLatewoodBump` | String |
| `String WoodUseManualLateColor { get; }` | `AdvancedWood.WoodUseManualLateColor` | String |
| `String WoodUsePores { get; }` | `AdvancedWood.WoodUsePores` | String |
| `String WoodUseRays { get; }` | `AdvancedWood.WoodUseRays` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```